Revit 2027 API
ParameterTypeId.FramingLengthRoundoff Property
 "Structural Framing Length Roundoff"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FramingLengthRoundoff { get; }
Public Shared ReadOnly Property FramingLengthRoundoff As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FramingLengthRoundoff {
	ForgeTypeId^ get ();
}
static member FramingLengthRoundoff : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace